#include <stdio.h>
#include <string.h>
/*
	。认真思考上述内容，看看是否
能用所学的知识解释程序清单10.15中的程序。该程序显示了一些地址值和
数组的内容。
	
*/
int example_10_2_main() {
	printf("* * * * * * * * * * * * * * * *\n");
	printf("this is example_10_2 \7\n");
	printf("* * * * * * * * * * * * * * * *\n");

	int zippo[4][2] = { { 2, 4 }, { 6, 8 }, { 1, 3 },{ 5, 7 } };
	printf("zippo = %p,   zippo + 1 = %p\n", zippo, zippo + 1);// { 2, 4 }, { 6, 8 }的首地址
	printf("zippo[0] = %p, zippo[0] + 1 = %p\n", zippo[0],zippo[0] + 1);//{ 2, 4 } 的地址
	printf("*zippo = %p,  *zippo + 1 = %p\n", *zippo, *zippo + 1);// { 2, 4 } 的地址
	printf("zippo[0][0] = %d\n", zippo[0][0]);//2
	printf("*zippo[0] = %d\n", *zippo[0]);//2
	printf("**zippo = %d\n", **zippo);//2
	printf("zippo[2][1] = %d\n", zippo[2][1]);//3
	printf("*(*(zippo+2) + 1) = %d\n", *(*(zippo + 2) + 1));//3
	/* * * * * * * * * 结论 * * * * * * * * *
	对二维数组来 数组变量[i][j]说:
	数组变量 是指针 ,子数组变量[i] 也是指针,分别指向子数组i的首地址
	如下
		可以看做 :数组变量={子数组0的首地址,子数组1的首地址,子数组2子的首地址,子数组3的首地址 .....子数组i的首地址.}
	子数组[i]也是数组
	如下
		子数组[i]={元素0,元素1,元素2,元素3 .....元素j.}
	所以二维数组的实际形态是:
		数组变量 = {
					子数组[0]={元素0,元素1,元素2,元素3 .....元素j.}
					子数组[1]={元素0,元素1,元素2,元素3 .....元素j.}
					子数组[2]={元素0,元素1,元素2,元素3 .....元素j.}
					.
					.
					.
					子数组[i]={元素0,元素1,元素2,元素3 .....元素j.}
		}
	数组变量(变量名) 实质就是指向 子数组0的首地址 的首地址 数组变量[i]实质是 子数组i的地址的地址
	因此 数组变量+1 时 等于 数组变量名[i] 首地址+1 会指向 数组变量名[i+1]即子数组i+1的地址
	因此 *数组变量[i]会指向子数组i的首地址也就是  *数组变量[i]=子数组i的首地址
	当*数组变量[i]+1时,等于子数组i的首地址+1,因此会指向子数组i的第二个元素


	默认指向子数组0,

	数组变量[i][j]
	---0. 数组变量  = 一个指针 = 指向数组的首地址 
	---1. 数组变量[i]:二维数组i下标表示二维数组的第(i+1)个成员数组的首地址;
	---2. *数组变量+i = 数组变量[i]
	---3. *(*(数组变量+i)+j) = 数组变量[i][j]
	---4. value=*p(指针):*是取指向指针的值,因此看指针指向哪里取值就是对应物理内存所存的值
	* * * * * * * * * 结论 * * * * * * * * */
	return 0;
}