#include <stdio.h>
#include <limits.h>
#include <float.h>
/*
	例题4.7:
*/
int example_4_4_main() {
	printf("* * * * * * * * * * * * * * * *\n");
	printf("this is example_4_4 % c\n", 7);
	printf("* * * * * * * * * * * * * * * *\n");
	//修饰符-标记 start
	printf("%05d %05d %05d %05d %010.1f\n", 90, 30, 100000, 200, 5000.0);//0标记,用0填充数字前面的空格 
	printf("%5d %5d %5d %5d %10.1f\n", 90, 30, 100000, 200, 5000.0);//对照组
	printf("* * * * * * * * * * * * * * * * * * * * * * *\n");


	printf("%5d%5d%5d%5d%5d\n", 90, 30, 100000, 200, 5000);//无标记默认右对齐
	printf("%-5d%-5d%-5d%-5d%-5d\n",90,30,-100000,-200,5000);//-标记左对齐
	printf("* * * * * * * * * * * * * * * * * * * * * * *\n");
	
	printf("%+5d%+5d%+5d%+5d%+5d\n", 90, -30, 100000, 200, -5000);//+标记,当数值为正数是会自动加上 + 号,为负数 则加上 -  号
	printf("% 5d% 5d% 5d% 5d% 5d\n",90,30,-100000,-200,5000);//" "(空格)标记,为负数则显示负号-,为正数则为空格
	printf("* * * * * * * * * * * * * * * * * * * * * * *\n");
	
	printf("%#o  %#x %#.1f %#+3.2e \n",90, 0xffa0b,30.0,-100000.0);//#标记,对八进制来说会在数值前面加0表示是八进制
	printf("%#o  %#x %#.2f %#+1.3e \n",90, 0xffa0b,30.0,-123456.0);//#标记,对十六进制来说会在数值前面加0x表示是十六进制
	printf("* * * * * * * * * * * * * * * * * * * * * * *\n");

	printf("%#o  %#x %#f %#+1.5e \n",90, 0xffa0b,0.0,-123456.0);//
	printf("%#o  %#x %f %#+1.5e \n",90, 0xffa0b,0.0,-123456.0);//
	printf("%#o  %#x %#.3f %#+1.5e \n",90, 0xffa0b,30.0,-123456.0);//
	printf("* * * * * * * * * * * * * * * * * * * * * * *\n");
	//修饰符-标记 end
	//修饰符-数字  %5d 表示打印数字的宽度,当数值超出宽度时会自动拓宽 见上面的例题


	//修饰符-.数字 start 例如%.5f 
	// 对%f和%e 来说表示小数点后面的位数
	printf("%.3f %.6e \n", 30.0, -123456.0);//
	printf("%.1f %.2e \n", 30.0, -123456.0);//
	printf("* * * * * * * * * * * * * * * * * * * * * * *\n");
	// 对%g和%G 来说表示有效数字的位数 即超过或者等于.数字表示的有效位数(即十的多少次方,有效位数的定义见float.h头文件)
	//即用科学计数法表示
	
	printf("%.1g %.1g \n", 30.0, -123456.0);//
	printf("%.1g %.1g \n", 30.001, -123456.001);//
	printf("%g %g \n", 30.0001, -123456.001);//
	printf("%.3g %.3g \n", 30.0001, -123456.001);//
	printf("%.6g %.6g \n", 30.0001, -123456.001);//
	printf("* * * * * * * * * * * * * * * * * * * * * * *\n");
	printf("%.2g %.2g \n", 30.0, -123456.0);//
	printf("%.3g %.3g \n", 30.0, -123456.0);//
	printf("%.4g %.4g \n", 30.0, -123456.0);//
	printf("%.5g %.5g \n", 30.0, -123456.0);//
	printf("%.6g %.6g \n", 30.0, -123456.0);//
	printf("* * * * * * * * * * * * * * * * * * * * * * *\n");

	// 对%s 来说表示打印字符串的前几个字符
	printf("%.6s  \n", "123456789");
	// 对%d 来说表示打印的最少个数,不足的高位用0补位
	printf("%.6d  \n", 1234);
	printf("%.6d  \n", 12345);
	printf("* * * * * * * * * * * * * * * * * * * * * * *\n");
	//修饰符-.数字 end 

	//修饰符-h start  和整形一起使用 表示short int 和 unsigned short int
	printf("%d  \n", SHRT_MAX);
	printf("%hd  \n", SHRT_MAX);
	printf("- - - - - - - - -\n");
	printf("%x  \n", SHRT_MAX);
	printf("%hx  \n", SHRT_MAX);
	printf("- - - - - - - - -\n");
	printf("%u  \n", USHRT_MAX);
	printf("%hu  \n", USHRT_MAX);
	printf("* * * * * * * * * * * * * * * * * * * * * * *\n");
	//修饰符-h END

	//修饰符 - hh, 表示singed char 或者unsinged char类型读,%hhd %hhu
	//修饰符j,表示intmax_t 和uintmax_t类型的值 示例:%jd,%jx
	//修饰符%td %zd分别表示指针差值返回值类型 ptrdiff_t  和  sizeof 的返回值类型size_t

	//修饰符 - l,ll(L小写),L   START 和整形转换说明一起用
	printf("%ld  \n", LONG_MAX);
	printf("%lld  \n", LLONG_MAX);
	printf("%Lf  \n", DBL_MAX);

	//printf("%Ld  \n", INT_MAX);%Ld会导致程序终止 后面的*号行打不出来
	printf("* * * * * * * * * * * * * * * * * * * * * * *\n");
	//修饰符 - l,ll(L小写),L  END 


	/* * * * * * * * * 结论 * * *
	转换说明把以二进制格式储存在计
	算机中的值转换成一系列字符（字符串）以便于显示。例如，数字76在计算
	机内部的存储格式是二进制数01001100。%d转换说明将其转换成字符7和
	6，并显示为76；%x转换说明把相同的值（01001100）转换成十六进制记数
	法4c；%c转换说明把01001100转换成字符L。
	转换（conversion）可能会误导读者认为原始值被转替换成转换后的
	值。实际上，转换说明是翻译说明，%d的意思是“把给定的值翻译成十进制
	整数文本并打印出来”。
	* * * * * * * * * 结论 * * * * * * * * */
	return 0;
}