#include <stdio.h>
//观察各个数据类型溢出情况:long类型 char类型 unsigned
int pratice_3_1_3_main() {
	printf("* * * * * * * * * * * * * * * *\n");
	printf("this is pratice_3-3\n");
	printf("* * * * * * * * * * * * * * * *\n");
	//long类型 4个字节  32个二进制位 取值范围-2147483648 ~2147483647 
	//long num = 2147483647;// 输出结果:2147483647 
	//long num = 2147483648;// 输出结果:-2147483648 
	//long num = 0-2147483648;// 输出结果:-2147483648 
	//long num = 0-2147483649;// 输出结果:2147483647
	long num = 0-2147483650;// 输出结果:2147483646
	printf("sizeof short %zd - 实际输出值:%d\n", sizeof(long), num);+
	printf("* * * * * * * * * * * * * * * *\n");
	/*********结论*********
		与int类型一致
	*********结论*********/

	//char 类型 1个字节 8个二进制位 取值范围  -128~127 
	
	//char c = 127;// 输出结果:127
	//char c = 128;// 输出结果:-128
	//char c = -128;//输出结果:-128
	char c = -129;//输出结果:127
	printf("sizeof char %zd - 实际输出值:%d\n", sizeof(char), c);
	/* * * * * * * * * 结论 * * * * * * * * *
		除了取值范围不同 原理都一样
	* * * * * * * * * 结论 * * * * * * * * */
	printf("* * * * * * * * * * * * * * * *\n");
	//unsigned 类型 4个字节 32个二进制位 取值范围  0~4294967296 注意 占位符要用u%
	//unsigned us = 4294967296; // 输出结果 : d% 0 u% 0
	//unsigned us = 4294967297; // 输出结果 : d% 1 u% 1
	//unsigned us = 4294967298; // 输出结果 : d% 2 u% 2
	//unsigned us = 4294967295; // 输出结果 : d% -1 u% 4294967295
	unsigned us = 4294967294; // 输出结果 : d% -2 u% 4294967294
	//===============================>注意 占位符要用u%<===============================
	printf("sizeof unsigned %zd - 实际输出值\\%\\u:%u\n", sizeof(unsigned), us);
	printf("sizeof unsigned %zd - 实际输出值\\%\\d:%d\n", sizeof(unsigned), us);
	//===============================>注意 占位符要用u%<===============================

	/* * * * * * * * * 结论 * * * * * * * * *
		与int和long等类型有所区别 取值范围没有负数
		且占位符不能使用%d 只能使用 %u 否则会出现异常
	* * * * * * * * * 结论 * * * * * * * * */
	return 0;
}