#include <stdio.h>
#include <ctype.h>
/*
5.修改程序清单8.4的猜数字程序，使用更智能的猜测策略。例如，程序
最初猜50，询问用户是猜大了、猜小了还是猜对了。如果猜小了，那么下一
次猜测的值应是50和100中值，也就是75。如果这次猜大了，那么下一次猜
测的值应是50和75的中值，等等。使用二分查找（binary search）策略，如
果用户没有欺骗程序，那么程序很快就会猜到正确的答案。

*/
int pratice_8_5_main() {
	printf("* * * * * * * * * * * * * * * *\n");
	printf("- - - - - - - - - - - - - - - -\n");
	printf("this is pratice_8_5 % c\n", 7);
	printf("- - - - - - - - - - - - - - - -\n");
	printf("* * * * * * * * * * * * * * * *\n");

	
	/* * * * * * * * * 结论 * * * * * * * * *

	* * * * * * * * * 结论 * * * * * * * * */
	return 0;
}