#include <stdio.h>
//观察各个数据类型溢出情况:long类型
int pratice_3_3_main() {
	printf("* * * * * * * * * * * * * * * *\n");
	printf("this is pratice_3-3\n");
	printf("* * * * * * * * * * * * * * * *\n");

	//long num = 2147483647;//2的31次方 输出结果:2147483647 
	//long num = 2147483648;//2的31次方 输出结果:-2147483648 
	//long num = 0-2147483648;//2的31次方 输出结果:-2147483648 
	//long num = 0-2147483649;//2的31次方 输出结果:2147483647
	long num = 0-2147483650;//2的31次方 输出结果:2147483646
	printf("sizeof short %zd - 实际输出值:%d\n", sizeof(long), num);
	/*********结论*********
		与int类型一致
	*********结论*********/
	return 0;
}