#include <stdio.h>
/*
5.修改程序addemup.c（程序清单5.13），你可以认为addemup.c是计算20
310
天里赚多少钱的程序（假设第1天赚$1、第2天赚$2、第3天赚$3，以此类
推）。修改程序，使其可以与用户交互，根据用户输入的数进行计算（即，
用读入的一个变量来代替20）。
*/
#define MINUTE 60
int pratice_5_5_main() {
	printf("* * * * * * * * * * * * * * * *\n");
	printf("- - - - - - - - - - - - - - - -\n");
	printf("this is pratice_5_5_____________________未完成 跳过 要找例题% c\n", 7);
	printf("- - - - - - - - - - - - - - - -\n");
	printf("* * * * * * * * * * * * * * * *\n");
	

	/* * * * * * * * * 结论 * * * * * * * * *

	* * * * * * * * * 结论 * * * * * * * * */
	return 0;
}